-- 中秋NPC
-- 群众

x050202_g_scriptId = 050202

x050202_g_festivalwords =
{
	"    世间清爽凉快的地方，首屈一指的还是这夜西湖啊！",
	"    今年夏天不乘凉，乘凉还来夜西湖！",
	"    这阵小风吹得人真是惬意啊！",
	"    明年夏天，我还来要夜西湖乘凉。",
	"    看这里！看这里！看这里！",
	"    夜西湖真是人间仙境啊，外边都三伏天了，听说这里还有雪人呢！",
	"    回去我就告诉朋友们，都来夜西湖乘凉！",
	"    只消山水光中，无事过这一夏。",
	"    梨花院落溶溶月，柳絮池塘淡淡风~~~",
	"    月上柳梢头，人约黄昏后~~~",
	"    我在那个小贩那里买了份绿豆汤，喝着还不错，你要不要来一碗？",
	"    那个小贩的绿豆汤不错，喝了真是凉透心脾啊，你要不要来一碗？",
	"    宁静的夏天，天空中繁星点点。",
	"    心里头有些思念，思念着你的脸。",	
	"    今年夏天真是爽，一天十碗绿豆汤。晚风吹得全身醉，夜西湖上好乘凉。",
	"    今年夏天真是帅，酷暑闷热都不在。天龙八部夜西湖，能把桃源仙境赛！",
	"    这里是夏天，这里又有雪人，真可谓是夏雪宜啊。",
	"    你爱喝冰镇的绿豆汤，还是常温的？",
	"    你瞧，你瞧，好多帅哥来西湖纳凉啊！",
	"    你瞧，你瞧，好多美女来西湖纳凉啊！"
}

--**********************************
--事件交互入口
--**********************************
function x050202_OnDefaultEvent( sceneId, selfId, targetId )
	BeginEvent( sceneId )
		local strText = x050202_g_festivalwords[random( getn(x050202_g_festivalwords) )]
		AddText( sceneId, strText )
	EndEvent( sceneId )
	DispatchEventList( sceneId, selfId, targetId )
end
