-- 中秋NPC
-- 群众

x050008_g_scriptId = 050008

x050008_g_festivalwords =
{
	"    我看到焰火啦！中，秋，快，乐~~~",
	"    今晚的月饼好圆啊，哦，我是说今晚的月亮好圆啊~~~",
	"    好美的月光啊！",
	"    好美的流星雨啊！",
	"    看这里！看这里！看这里！",
	"    一闪一闪亮晶晶，满天都是小月饼！",
	"    今年中秋不收礼，收礼还收大月饼！",
	"    但愿人长久，千里共婵娟~~~",
	"    东风夜放花千树，更吹落，星如雨~~~",
	"    月上柳梢头，人约黄昏后~~~",
	"    我这月饼是枣泥馅的，你要不要来一个？",
	"    我这月饼是薄荷馅的，你要不要来一个？",
	"    你有没有豆沙馅的月饼，我好想吃啊~~~",
	"    你有没有桂圆馅的月饼，我好想吃啊~~~",	
	"    月亮月亮圆又圆，挂在天上像玉盘。如果月亮变月饼，最好能是豆沙馅！",
	"    月亮月亮白又白，挂在天上下不来。如果月亮变月饼，最好……还是能下来！",
	"    天上的月亮这样圆，又这样白。",
	"    你爱吃碱的月饼，还是甜的？",
	"    你瞧，你瞧，好多帅哥来西湖赏月啊！",
	"    你瞧，你瞧，好多美女来西湖赏月啊！"
}

--**********************************
--事件交互入口
--**********************************
function x050008_OnDefaultEvent( sceneId, selfId, targetId )
	BeginEvent( sceneId )
		local strText = x050008_g_festivalwords[random( getn(x050008_g_festivalwords) )]
		AddText( sceneId, strText )
	EndEvent( sceneId )
	DispatchEventList( sceneId, selfId, targetId )
end
